/*----------------------------------------------------------------------------
 * 文件编码约定: 本文件为 UTF-8 编码(带BOM)。
 * 本工程源码统一使用 UTF-8(带BOM) 保存: 新建或修改任何源文件时,
 * 请以 UTF-8 编码保存, 并在文件头保留本注释。
 *----------------------------------------------------------------------------*/
#ifndef __DCHMINOTIFYBUTTON_H__
#define __DCHMINOTIFYBUTTON_H__
/*****************************************************************************/
#ifdef __cplusplus
extern "C" {
#endif
/*****************************************************************************/
#include "dcHmiApp.h"
#include "sPlc.h"
/*****************************************************************************/
void NotifyButton(uint16_t screen_id, uint16_t control_id, uint8_t state);
/*****************************************************************************/
#ifdef __cplusplus
}
#endif
#endif




