#ifndef __MAINAPP_H__
#define __MAINAPP_H__
/*****************************************************************************/
#include "sPlc.h"
#include "dcHmiApp.h"
/*****************************************************************************/
#ifdef __cplusplus
extern "C" {
#endif
/*****************************************************************************/
extern uint8_t gddcHmiRxBuf[];
extern __IO uint8_t adcBufferDone;//ADC 采集完毕
/*****************************************************************************/
extern void mainAppTask(void *argument);
/*****************************************************************************/
#ifdef __cplusplus
}
#endif
#endif



