/*----------------------------------------------------------------------------
 * 文件编码约定: 本文件为 UTF-8 编码(带BOM)。
 * 本工程源码统一使用 UTF-8(带BOM) 保存: 新建或修改任何源文件时,
 * 请以 UTF-8 编码保存, 并在文件头保留本注释。
 *----------------------------------------------------------------------------*/
#include "sPlc.h"
/*****************************************************************************/
void PmuPowerUp(void){//开机函数
//空硬件开机与软件无关

}

void PmuPowerDown(void){//关机函数
	NVSAVE();//单片机同步NVRAM
	SET_PWR_KILL_POWER_OFF;//给LTC2955 KILL信号实现软关机
	while(1);
}
/*****************************************************************************/






